app/views/articles/_form.html.erb

  <%
      @members = Member.order_by_unit_kana.map{|m| [m.name, m.id]}
---
SELECT "members".* FROM "members"