app/views/articles/_requestmember_fields.html.erb

  <%= f.hidden_field :id %>
  <%= f.select :member_id, options_for_select(Member.all.map{|m| [m.name, m.id]}, f.object.member_id) %>
---
SELECT "members".* FROM "members"