app/views/articles/index.html.erb

        <td>
          <% article.members.each do |requestmember| %>
---
SELECT "members".* FROM "members" INNER JOIN "requestmembers" ON "members"."id" = "requestmembers"."member_id" WHERE "requestmembers"."article_id" = ?  [["article_id", 1]]