app/views/articles/show.html.erb

SELECT "members".* FROM "members" INNER JOIN "requestmembers" ON "members"."id" = "requestmembers"."member_id" WHERE "requestmembers"."article_id" = ?  [["article_id", 11]]
---
  	  <td>
        <% @article.members.each do |requestmember| %>

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "members" INNER JOIN "requestmembers" ON "members"."id" = "requestmembers"."member_id" WHERE "requestmembers"."article_id" = ?  [["article_id", 2]]
---
<br>
<a href="https://twitter.com/share?text=譲:<%= @article.member.name %> 求:<% @article.members.each_with_index do |requestmember, i| %><%= requestmember.name %><%= i+1>=@article.members.count ? '' : ','%><% end %>" class="tweetbtn" data-lang="ja" data-size="large" data-count="none" data-hashtags="3Bjr写真交換">