app/controllers/articles_controller.rb

  def index
    @articles = Article.search(params[:article_search]).page(params[:page]).per(10).order(:id)
---
SELECT  "articles".* FROM "articles"  ORDER BY id DESC, "articles"."id" ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def new
    if user_signed_in?
      @article = Article.new

      current_user.favoritemembers.each do |favoritemember|
---
SELECT "members".* FROM "members"

  def create

    @article = Article.new(article_params)
    @article.user_id = current_user.id
    @article.close_flag = false

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("message", "close_flag", "member_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["message", "bbbbb"], ["close_flag", "f"], ["member_id", 1], ["user_id", 1], ["created_at", "2015-09-29 07:55:02.324610"], ["updated_at", "2015-09-29 07:55:02.324610"]]

  def update

    if !(@article.user_id == current_user.id)
      respond_to do |format|
        format.html { render :show, notice: 'この投稿は変更できません。' }
      end
    else
      respond_to do |format|

        if @article.update(article_params)
---
UPDATE "articles" SET "obverse_photo" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["obverse_photo", "from_rocky_ebi_hina_since_2011_01_01_until_2013_09_01___Twitter__.png"], ["updated_at", "2015-09-30 11:47:04.009508"], ["id", 12]]

  def destroy

    if !(@article.user_id == current_user.id)
      respond_to do |format|
        format.html { render :show, notice: 'この投稿は変更できません。' }
      end
    else

      twitterClient = TwitterClient.new
      twitterClient.destroy(@article)
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 14]]