app/controllers/members_controller.rb

INSERT INTO "members" ("name", "unit_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "あみぽん"], ["unit_id", 1], ["created_at", "2015-09-29 08:17:07.607682"], ["updated_at", "2015-09-29 08:17:07.607682"]]
---
  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save

UPDATE "members" SET "unit_id" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["unit_id", 1], ["updated_at", "2015-09-29 07:40:38.079980"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @member.update(member_params)