app/controllers/requestmembers_controller.rb

  def index
    @requestmembers = Requestmember.all
---
SELECT "requestmembers".* FROM "requestmembers"