app/controllers/units_controller.rb

SELECT "units".* FROM "units"
---
  def index
    @units = Unit.all

INSERT INTO "units" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "キングレコード組(仮)"], ["created_at", "2015-09-29 07:23:18.770353"], ["updated_at", "2015-09-29 07:23:18.770353"]]
---
  def create
    @unit = Unit.new(unit_params)

    respond_to do |format|
      if @unit.save

UPDATE "units" SET "name" = ?, "updated_at" = ? WHERE "units"."id" = ?  [["name", "マジェスティック7・中原咲耶"], ["updated_at", "2015-10-09 05:23:34.581291"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @unit.update(unit_params)

DELETE FROM "units" WHERE "units"."id" = ?  [["id", 6]]
---
  def destroy
    @unit.destroy

SELECT  "units".* FROM "units" WHERE "units"."id" = ? LIMIT 1  [["id", 6]]
---
    def set_unit
      @unit = Unit.find(params[:id])