app/views/searcharticles/index.html.erb

SELECT "members".* FROM "members"
---
<%= form_tag articles_path, :method => 'get' do %>
  譲:<%= collection_select 'article_search', 'member_id', Member.all, :id, :name, :include_blank => true %> <br>