app/controllers/users/omniauth_callbacks_controller.rb

INSERT INTO "users" ("provider", "uid", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["provider", "twitter"], ["uid", "209984728"], ["username", "schwarzritter09"], ["created_at", "2015-09-29 05:35:27.552354"], ["updated_at", "2015-09-29 05:35:27.552354"]]
---
  def twitter
    @user = User.find_or_create_by(user_params)