app/views/members/_form.html.erb

SELECT "units".* FROM "units"
---
    <%= f.label :unit_id %><br>
    <%=
      @units = Unit.all.map{|u| [u.name, u.id]}